//1
// console.log('number' + 3 + 3); // Результат number33, так як це неявне порівняння.

//2
//console.log(null + 3); // Результат буде 3, так як null перетворюється на 0, і 3+0=3

//3
// console.log(5 && "qwerty"); // Результат буде qwerty тому що це останнє істинне значення(тому що в даному випадку обидва значення істинні)

//4
// console.log(+'40' + +'2' + "hillel"); // Результат буде 42hillel, "40" і "2" перетворились на цифри і сумувались(через + пред ними), а текст залишився текстом.

//5
// console.log('10' - 5 === 6); // Результат буде false, тому що "10" перетворилось в число і провелось віднімання, 10-5=5, а === означає строгу рівність, а отже значення хибне

//6
// console.log(true + false); // Результат буде 1, так як true перетворюється на 1, а false на 0

//7
// console.log('4px' - 3); // Результат буде NaN, так як '4px' неможливо перетворити на число

//8
// console.log('4' - 3); // Результат буде 1, так як "4" перетворилось на число, 4-3=1

//9
// console.log('6' + 3 ** 0); // Результат 61, 3 ** 0  -  3 у нульовому ступені буде 1. Рядок '6' + 1 проводиться конкатенація(так як + виконує не додавання)

//10
// console.log(12 / '6'); // Результат 2, так як відбувається ділення 12 на 6. Рядок "6" перетворюється на число

// 11
// console.log('10' + (5 === 6)); // Результат 10false, так як 5 не дорівнює 6(строга рівність ===) цей результат виводиться як false, далі відбувається конкатенація і false перетворюється на "false"

//12
// console.log(null == ''); // Результат буде false, так як null перетворюється в undefined, а '' це порожній рядок, рівності немає

//13
// console.log(3 ** (9 / 3)); // Результат буде 27, так як 9 поділити на 3 буде 3, і 3 зведене в 3 ступінь буде 27

//14
// console.log(!!'false' == !!'true'); // Результат буде true.  !! Подвійне заперечення, оператор перетворює значення на boolean, так як рядок 'false' не пустий, він перетворюється на true, рядок 'true' також не пустий, отже він також пертворюється на true

//15
// console.log(0 || '0' && 1); // Результат буде 1. Спочатку проводиться операція && і повертає останнє істинне значення 1,(так як "0" не пустий рядок це true і 1 це теж true), операція || 0 це хибне значення,а 1 істинне, отже повернеться значення 1

//16
// console.log((+null == false) < 1); // Результат буде false. Через + перед null - перетворюється на 0. Оператор == прирівнює false до 0. Отже true<1 виведеться false

//17
// console.log(false && true || true); // Результат буде true. Спочатку проводиться операція && - виводиться перше фальшиве  значення false, а далі false|| true - повертає перше істинне значення, а отже true

//18
// console.log(false && (false || true)); //Результат буде false. Спочатку проводиться операція (false || true) так як вони в дужках. Виводиться перше істинне значення,а отже true. Наступна операція буде false && true - виведеться перше фальшиве значення, а отже false.

//19
// console.log((+null == false) < 1 ** 5); //Результат буде false. Спочатку дія в дужках (+null == false) - +null перетворюється на 0, false в операції == також перетворюється на 0, отже результат буде true. Далі по пріоритету проводиться операція зведення у ступінь 1 ** 5 = 1. Далі true < 1 виведеться false, так як  true прирівнюється до 1, а отже даний вираз невірний, тому виведеться  false.
